In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./data/titanic.csv")

In [9]:
def get_column_type(df):
    return dict(zip(list(df.columns), list(map(str, df.dtypes))))

In [10]:
get_column_type(df)

{'PassengerId': 'int64',
 'Survived': 'int64',
 'Pclass': 'int64',
 'Name': 'object',
 'Sex': 'object',
 'Age': 'float64',
 'SibSp': 'int64',
 'Parch': 'int64',
 'Ticket': 'object',
 'Fare': 'float64',
 'Cabin': 'object',
 'Embarked': 'object'}

In [7]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
dict(df.dtypes)

{'PassengerId': dtype('int64'),
 'Survived': dtype('int64'),
 'Pclass': dtype('int64'),
 'Name': dtype('O'),
 'Sex': dtype('O'),
 'Age': dtype('float64'),
 'SibSp': dtype('int64'),
 'Parch': dtype('int64'),
 'Ticket': dtype('O'),
 'Fare': dtype('float64'),
 'Cabin': dtype('O'),
 'Embarked': dtype('O')}

In [48]:
def write_csv_to_nas(df, **kwargs):
    params = {"sep":",", "index":False, "encoding":  "utf-8"}
    params.update(**kwargs)

    path = "./test.csv"
    
    df.to_csv(path, **params)
    return str(path)

In [49]:
def get_dtypes(df):
    return dict(zip(list(df.columns), list(map(str, df.dtypes))))

In [50]:
use_column = ['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age']


order_column = ['Age', 'Name', 'PassengerId', 'Pclass', 'Sex', 'Survived']

rename_column = ['PassengerId_3',
 'Survived_6',
 'Pclass_4',
 'Name_2',
 'Sex_5',
 'Age_1']

column_type = ['object',
 'object',
 'object',
 'object',
 'object',
 'object']

In [51]:
def update_column_name(df, use_list, rename_list):
    column_dict = dict(zip(use_list, rename_list))
    print(column_dict)
    return df.rename(columns=column_dict)

def update_column_order(df, column_list):
    return df[column_list]

def update_column_type(df, type_list):
    return df.astype(dict(zip(list(df.columns), type_list)))

In [52]:
df = update_column_type(df, column_type)
df = update_column_order(df, order_column)
df = update_column_name(df, use_column, rename_column)

{'PassengerId': 'PassengerId_3', 'Survived': 'Survived_6', 'Pclass': 'Pclass_4', 'Name': 'Name_2', 'Sex': 'Sex_5', 'Age': 'Age_1'}

In [53]:
df

,Age_1,Name_2,PassengerId_3,Pclass_4,Sex_5,Survived_6
0,22,"Braund, Mr. Owen Harris",1,3,male,0
1,38,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2,1,female,1
2,26,"Heikkinen, Miss. Laina",3,3,female,1
3,35,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,female,1
4,35,"Allen, Mr. William Henry",5,3,male,0
...,...,...,...,...,...,...
886,27,"Montvila, Rev. Juozas",887,2,male,0
887,19,"Graham, Miss. Margaret Edith",888,1,female,1
888,NaN,"Johnston, Miss. Catherine Helen ""Carrie""",889,3,female,0
889,26,"Behr, Mr. Karl Howell",890,1,male,1
890,32,"Dooley, Mr. Patrick",891,3,male,0

In [61]:
df.dtypes

Age_1            object
Name_2           object
PassengerId_3    object
Pclass_4         object
Sex_5            object
Survived_6       object
dtype: object

In [62]:
write_csv_to_nas(df)

'./test.csv'

In [57]:
df2 = pd.read_csv('./test.csv')

In [58]:
df2.dtypes

Age_1            float64
Name_2            object
PassengerId_3      int64
Pclass_4           int64
Sex_5             object
Survived_6         int64
dtype: object

In [59]:
list(df2.columns)

['Age_1', 'Name_2', 'PassengerId_3', 'Pclass_4', 'Sex_5', 'Survived_6']

In [60]:
use_column = ['Age_1', 'Name_2', 'PassengerId_3', 'Pclass_4', 'Sex_5', 'Survived_6']